Poiseuille-flow/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1000;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


functions
{

       sample
    {
        type            sets;
        functionObjectLibs ("libsampling.so");
        writeControl    timeStep;
        writeInterval   1;

        setFormat       gnuplot;
        interpolationScheme cellPoint;

        fields
        (
            U
            p
        );

        sets
        (
            veritcal
            {
                type        uniform;
                axis        y;
                start       (0.8 0 0);
                end         (0.8 0.1 0);
                nPoints     100;
            }
            horizontal
            {
                type        uniform;
                axis        x;
                start       (0 0.05 0);
                end         (1 0.05 0);
                nPoints     100;
            }
           
        );
    }


}



// ************************************************************************* //
